[Cues]
Act_E2_4C_CampusB_BeginsRewind_VoiceOver01_Max_010="She can't die. She can't."
Act_E2_4C_CampusB_BeginsRewind_VoiceOver01_Max_020="I have to use every bit of my power to go back and stop her..."
Act_E2_4C_CampusB_BeginsRewind_VoiceOver01_Max_030="Not again, not now..."
Act_E2_4C_CampusB_BeginsRewind_VoiceOver01_Max_040="I have to try something... I won't be able to rewind again and again..."
Act_E2_4C_CampusB_VoiceOver_Max_010="I need to get to the dormitory door to reach the roof..."
Act_E2_4C_CampusB_VoiceOver_Max_020="Do it, Max, you have to save Kate..."
Act_E2_4C_CampusB_VoiceOver_Max_030="God, my head feels like it's splitting... but I need to get to the dormitory now."
Act_E2_4C_CampusB_VoiceOver_Max_040="Come on Max, don't wuss out... Kate needs you."
Act_E2_4C_CampusB_VoiceOver_Max_050="Forget about the pain in your skull... Kate hurts more than you..."
Act_E2_4C_CampusB_VoiceOver_Max_060="Max, head to the dormitory for quick access to the roof."
Act_E2_4C_CampusB_VoiceOver_Max_070="Kate! No! Oh God, I have to do something to help her!"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_001="Did you come to get another Pulitzer shot like yesterday, Max?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_002="Max, seriously, don't come near me. I will jump."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_008="I know you only stand up for yourself. That's why you let David get in my face. Like everybody here..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_009="Really? So you took a picture to find out?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_010="I know you're scared of David. He's scary. And I know you only want to help."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_011="More like you wanted another shot for the Max Caulfield scrapbook. You want another now? Huh?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_013="You'll find out if I jump right now... Everybody will..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_018="Yes, they want to help kill me. And they can get their wish..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_019="Get out of here Max, you can't change my mind. My life sucks and I want it over. Now."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_020="I wish you could... It's too late now. There's nothing for me here anymore..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_021="But I do. My life is already over..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_023="Oh Max, I know you want to help me... I love that you stepped up to David, but it doesn't matter now. Nothing matters."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_025="I do want to believe that..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_027="You are such a liar! You wanted to help by ignoring my phone call?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_028="I'm glad to hear you worry about me... That makes me feel better..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_034="Apparently her problem is worse than mine. So why even bother with me? I'm done anyway."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_035="I needed you to answer, Max. Everybody thinks I'm a viral slut now."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_036="So obviously you're all good with ignoring your friends. Like me. So who cares if Kate lives or dies?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_037="I swear too—bullshit! Everybody says that to get out of talking!"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_039="Don't say anything if you're going to use a dead phone excuse! Just tell me you didn't answer."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_045="I did feel better talking to you on the phone. I always feel like you really listen."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_047="The fact that you don't care about that video and would come up here to stop me|means a lot..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_053="I told you exactly what happened! Well, it's too late to help, Max. Too late."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_054="Nathan Prescott? That makes sense... He's a scumbag. You have proof now?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_055="You get to "be careful," but I'm the one in the goddamn video! Too late, Max. You're too late."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_056="Yeah, it's all about Max Caulfield. I can't trust you or anybody! What's the point?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_057="You sound so persuasive, Max... If only..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_060="You do have my back, Max. That's the first time I've felt hopeful in a week..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_067="You don't know my mother. At all. She already thinks Satan has me on the fast-track to Hell. Let's prove it..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_068="You don't know me at all, Max. I told you I only have sisters. You never listen, because you don't give a damn! You will now!"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_069="Dad does care... even though I hurt him... He's the only one I know who believes in me..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_071="That's Lynn... she's only ten... She does have the best smile ever... I would hate to see her sad..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_074="Nice try, Max. But God put me on this roof."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_079="I don't believe in justice, Max. I don't believe in anything anymore..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_080="What difference does it make? I'm already in Hell anyway..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_081=""Matthew 11:28"... I can't believe you quoted one of my favorite passages..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_085="No... Nobody cares about me, nobody..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_094="You can't scrub my video from the internet... and that's how I'll be remembered. Unless I jump..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_095="I'd like that... I wouldn't mind just being a student again... Is it possible to go back and start over, Max?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_096="Oh God. Please, Max. You haven't seen the looks I get... or the laughs."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_099="Yep, my life is a blip. Blackwell taught me I'm worthless. I'll prove it right now..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_105="It won't Max, it won't...I was drugged and nobody believes me, not even the students here that are supposed to be my friends."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_111="You are clueless, Max. Brooke makes fun of me, because I'm not an atheist. Maybe I am now..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_112="I saw Dana watching the video with Trevor. Some friends. Fake. Like my whole stupid life..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_113="I know... you're right. She never judged me. Or doubted me."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_114="No. If anything she's been more sweet. I guess I shouldn't judge everybody, you think?"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_121="Thanks for that, but I needed you more when I called to actually talk. That's when I needed a friend."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_124="That's your story now. How can I trust you? What about this morning when I needed help? You told me to do nothing!"
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_125="Are you serious? Thank you so much..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_130="Can we really, Max? I don't believe in miracles anymore either."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_133="Like everybody at Blackwell, it's all about you. Even when I'm the victim."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_134="Max, I'm in a nightmare and I can't wake up... unless I put myself to sleep. Then everybody at Blackwell can post pics of my body... I'm already on the internet forever. No wonder they call it a "web"—nothing can ever get out. Like my video... I wish I could go back in time and erase everything..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_136="You're such a good person, Max. Even if you're full of crap. But I'll come with you...You're my friend."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_137="Oh Max... when you say it like that I want to believe you so bad..."
Cue_E2_4C_CampusB_CHKate_Phase01_Kate_138="Oh please! Now you want to help me? What about this morning when I needed it? You told me to do nothing!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_004="I've been bullied too, Kate. And even when I got picked on, I stood up for myself."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_005="I only wanted proof that David was harassing you!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_006="I had no idea what was going on between you and David..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_007="I'm so sorry, Kate. I thought I could help, but not by taking a picture. I'm ashamed..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_012="How else would I find out?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_014="That's not true. People want to help you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_015="Kate, don't! Please!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_016="I let you down and I'm sorry. I only want to help you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_017="No! Please Kate, you know me better than that... and I know you don't want to jump."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_022="Okay, okay. I'm right here. Kate, please..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_024="You matter. And not just to me."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_026="Kate, your life is still yours. And we can get through this together... Let me help."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_029="I was with Chloe and she was having a serious problem too. I'm sorry."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_030="I swear, it was in silent mode and I didn't see it or I totally would have answered!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_031="My phone died and I didn't have my charger. I swear..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_032="Of course I worry. You're my friend, Kate."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_033="I thought it was Warren! He's been blowing up my phone ever since I gave him my number..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_038="Not me. In fact, I was going to get a brand new phone..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_040="There is no "everybody"—there's only your friends and your family who love you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_041="No, you're not. And I'm here for you..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_042="I fucked up and I'm sorry. Look, I'm here for you now."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_043="I do! Just step back and listen to me!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_044="Kate, please trust me. Come stand by me, okay? I can help you now... I know I can."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_049="Kate, I'm gathering proof that Nathan Prescott drugged you. And you're not the only victim. So you have to help me take Nathan down."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_051="I wasn't sure what to do. There's been so much crazy shit going on, I... I can't even explain..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_052="Of course. Like I said this morning, I think Nathan is involved. I just need time to prove it. And I have a way with time..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_058="Kate, I believe you. Will you believe me?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_059="Soon. Then straight to the police. Think of it like we're cleansing Blackwell..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_061="Good. We all need to have each other's backs. So I want you to come with me now..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_063="What about your mother, Kate? You'll destroy her. She doesn't care about a video. She loves you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_064="Wait Kate, think about your brothers. They need their sister..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_065="Kate, I saw that card from your father. You can count on him, he clearly loves you without question."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_066="I saw that cute photo of you with your sisters in your room this morning. I can see how much your little sister loves you by her smile."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_070="See? You're not alone. And nobody down there wants to see you up here."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_072="Then make Lynn happy and step towards me. If she was here, you would know what to do."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_073="No! Kate, please stop... Listen..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_075="How does that Proverb go? "When justice is done, it brings joy to the righteous but terror to the evildoers...""
Cue_E2_4C_CampusB_CHKate_Phase01_Max_076="Maybe I'm put here to help you, Kate. And maybe you're here to help me. You already have more than I can explain..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_077=""Come to me, all you who are weary and burdened, and I will give you rest...""
Cue_E2_4C_CampusB_CHKate_Phase01_Max_078="Suicide is a sin, isn't it? If you believe in Hell... you might end up there. I don't want that to happen..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_082="Believe it, Kate. Now come down with me..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_083="Kate, this will crush your father. You think he cares about a video? He loves you unconditionally..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_084="You told me about your sisters, especially the youngest one... What's her name?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_086="This isn't the end, Kate. There's no way God doesn't have big plans for you here..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_088="Kate, stop... Let me talk to you..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_089="Nobody cares, Kate. There'll be another viral Victoria video in a day and everybody will forget."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_090="Kate, there are billions of videos out there. Yours will fade away like white noise."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_092="Once the truth comes out about how you were drugged, everybody will believe you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_093="Kate, this is our chance to beat the bullies. That's the only way we can win against them."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_098="I understand, truly. I get bullied too! But this is a blip..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_100="Kate, if there's one thing I believe... it's exactly that. Now can we hug this out?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_101="Forever. Can we hug on it?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_102="Kate! You can't do this to all the people who care about you!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_103="I know this is terrible for you, but like the good book says, this too shall pass..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_106="Brooke is your friend, isn't she?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_107="I know that Alyssa believes you. Has she ever treated you any different than before?"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_108="Of course Stella believes you! She's never bought into this video bullshit!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_109="What about Dana? She believes you..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_110="Like I said, I care about you. I know this passage means a lot to you."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_119="Don't worry Kate, things will get better. I promise."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_120="Like I helped by erasing all that crap people wrote on your room slate..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_122="I'll always be here for you Kate. My new motto is, "Friends come first.""
Cue_E2_4C_CampusB_CHKate_Phase01_Max_123="This morning I erased the weblink to the video... It was written on the shower room mirror..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_126="I care about you because I believe you were drugged. We will find out who did this and make them pay."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_127="Yes... I know I screwed up. I'm sorry, Kate."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_128="Wait, Kate! I am sorry!"
Cue_E2_4C_CampusB_CHKate_Phase01_Max_129="Please... you don't have to do this..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_131="I believe you Kate. But it's dangerous for both of us if I get involved now..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_132="I needed more time to investigate on my own first... but we have to be careful..."
Cue_E2_4C_CampusB_CHKate_Phase01_Max_135="Now I do. You're part of the reason why. If you come down with me, I can tell you more..."
Cue_E2_4C_CampusB_CommentingKate_IGE_Alyssa_050="I cannot believe this, Brooke..."
Cue_E2_4C_CampusB_CommentingKate_IGE_Brooke_060="Poor Kate. That fucking viral video..."
Cue_E2_4C_CampusB_CommentingKate_IGE_Courtney_090="I didn't think she was that messed up..."
Cue_E2_4C_CampusB_CommentingKate_IGE_Courtney_160="Oh my God!"
Cue_E2_4C_CampusB_CommentingKate_IGE_Daniel_020="Oh no, is that Kate?"
Cue_E2_4C_CampusB_CommentingKate_IGE_Daniel_110="Man, this is so not why I came to Blackwell..."
Cue_E2_4C_CampusB_CommentingKate_IGE_Juliet_120="Is this for real?"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy01_040="Holy shit, that chick is right on the ledge!"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy01_170="Shit!"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy02_010="Who is that up there?"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy02_030="I hope not..."
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy02_150="Long enough..."
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy02_200="Did you see that?"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenBoy03_140="How long has she been up there?"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenGirl01_070="If she jumps, she might not die."
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenGirl01_190="No!"
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenGirl02_080="Yes, she will."
Cue_E2_4C_CampusB_CommentingKate_IGE_TeenGirl02_180="No!"
Cue_E2_4C_CampusB_CommentingKate_IGE_Zachary_210="Whoa!"
Cue_E2_4C_CampusB_Freeze_RTC_Max_010="Keep... going... Max..."
Cue_E2_4C_CampusB_Freeze_RTC_Max_020="You... can... do it..."
Cue_E2_4C_CampusB_Insertion_TeenBoy01_070="Bitch flipped out!"
Cue_E2_4C_CampusB_Insertion_TeenGirl01_010="Don't! Come down! Get down!"
Cue_E2_4C_CampusB_KateIsAlive_RTC_Kate_010="I'm sorry... sorry..."
Cue_E2_4C_CampusB_KateIsAlive_RTC_Max_020="What are you talking about? You saved me from talking in class!"
Cue_E2_4C_CampusB_KateIsDead_Max_010="No!"
Cue_E2_4C_CampusB_NoMoreRewind_Max_010="Not now..."
Cue_E2_4C_CampusB_NoMoreRewind_Max_020="It won't work... I don't have any power..."
Cue_E2_4C_CampusB_NoMoreRewind_Max_030="Now I have to do this by myself..."
Cue_E2_4C_CampusB_RoofArrival_Kate_020="What are you doing here, Max?"
Cue_E2_4C_CampusB_RoofArrival_Kate_030="Stop! Don't come near me!"
Cue_E2_4C_CampusB_RoofArrival_Max_010="Yes..."
